Ran Plan for dir: `live/dev/webserver-cluster` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.asg.aws_autoscaling_group.this will be updated in-place
~ resource "aws_autoscaling_group" "this" {
        arn                       = "arn:aws:autoscaling:eu-west-2:565938106136:autoScalingGroup:e48c5bec-a68f-495d-a8d6-688330bf6e4c:autoScalingGroupName/tf-asg-20200519191928867900000002"
        availability_zones        = [
            "eu-west-2a",
            "eu-west-2b",
            "eu-west-2c",
        ]
        default_cooldown          = 300
        desired_capacity          = 1
        enabled_metrics           = []
        force_delete              = false
        health_check_grace_period = 300
        health_check_type         = "ELB"
        id                        = "tf-asg-20200519191928867900000002"
      ~ launch_configuration      = "terraform-20200519191928163400000001" -> (known after apply)
        load_balancers            = []
        max_instance_lifetime     = 0
        max_size                  = 3
        metrics_granularity       = "1Minute"
        min_size                  = 1
        name                      = "tf-asg-20200519191928867900000002"
        protect_from_scale_in     = false
        service_linked_role_arn   = "arn:aws:iam::565938106136:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling"
        suspended_processes       = []
        target_group_arns         = [
            "arn:aws:elasticloadbalancing:eu-west-2:565938106136:targetgroup/tf-atlantis-atlantis/97ae6ce606260609",
        ]
        termination_policies      = []
        vpc_zone_identifier       = [
            "subnet-273ae16b",
            "subnet-7fc85c05",
            "subnet-d5367ebc",
        ]
        wait_for_capacity_timeout = "10m"

        tag {
            key                 = "Name"
            propagate_at_launch = true
            value               = "tf-atlantis"
        }
    }

  # module.asg.aws_launch_configuration.this must be replaced
+/- resource "aws_launch_configuration" "this" {
      ~ arn                              = "arn:aws:autoscaling:eu-west-2:565938106136:launchConfiguration:5f50487c-af52-4cf1-9e1b-f6e51e2d4ea5:launchConfigurationName/terraform-20200519191928163400000001" -> (known after apply)
        associate_public_ip_address      = false
      ~ ebs_optimized                    = false -> (known after apply)
        enable_monitoring                = true
        iam_instance_profile             = "ora2postgres_atlantis"
      ~ id                               = "terraform-20200519191928163400000001" -> (known after apply)
        image_id                         = "ami-01a6e31ac994bbc09"
        instance_type                    = "t2.micro"
        key_name                         = "atlantis"
      ~ name                             = "terraform-20200519191928163400000001" -> (known after apply)
      ~ security_groups                  = [
          - "sg-00716cfa523becb7a",
          - "sg-061d8533c15b48235",
          - "sg-08b15b34c3c2eaf93",
          - "sg-0cf06e35da33a8a10",
        ] -> (known after apply) # forces replacement
        user_data                        = "cd7e23e345873647872975ce5bf1e9ea1b759541"
      - vpc_classic_link_security_groups = [] -> null

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.asg.aws_security_group.atlantis will be destroyed
- resource "aws_security_group" "atlantis" {
      - arn                    = "arn:aws:ec2:eu-west-2:565938106136:security-group/sg-0cf06e35da33a8a10" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [] -> null
      - id                     = "sg-0cf06e35da33a8a10" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 4141
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 4141
            },
        ] -> null
      - name                   = "tf-atlantis-atlantis" -> null
      - owner_id               = "565938106136" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - vpc_id                 = "vpc-371c5a5f" -> null
    }

  # module.asg.aws_security_group.dmz will be created
+ resource "aws_security_group" "dmz" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "tf-atlantis-dmz"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # module.asg.aws_security_group.ssh will be destroyed
- resource "aws_security_group" "ssh" {
      - arn                    = "arn:aws:ec2:eu-west-2:565938106136:security-group/sg-08b15b34c3c2eaf93" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [] -> null
      - id                     = "sg-08b15b34c3c2eaf93" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
        ] -> null
      - name                   = "tf-atlantis-ssh" -> null
      - owner_id               = "565938106136" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - vpc_id                 = "vpc-371c5a5f" -> null
    }

  # module.asg.aws_security_group.web will be destroyed
- resource "aws_security_group" "web" {
      - arn                    = "arn:aws:ec2:eu-west-2:565938106136:security-group/sg-00716cfa523becb7a" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [] -> null
      - id                     = "sg-00716cfa523becb7a" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "tf-atlantis-web" -> null
      - owner_id               = "565938106136" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - vpc_id                 = "vpc-371c5a5f" -> null
    }

  # module.asg.aws_security_group.world will be destroyed
- resource "aws_security_group" "world" {
      - arn                    = "arn:aws:ec2:eu-west-2:565938106136:security-group/sg-061d8533c15b48235" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-061d8533c15b48235" -> null
      - ingress                = [] -> null
      - name                   = "tf-atlantis-out" -> null
      - owner_id               = "565938106136" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - vpc_id                 = "vpc-371c5a5f" -> null
    }

  # module.asg.aws_security_group_rule.allow_all_out must be replaced
-/+ resource "aws_security_group_rule" "allow_all_out" {
        cidr_blocks              = [
            "0.0.0.0/0",
        ]
        from_port                = 0
      ~ id                       = "sgrule-4136366633" -> (known after apply)
        ipv6_cidr_blocks         = [
            "::/0",
        ]
      - prefix_list_ids          = [] -> null
        protocol                 = "-1"
      ~ security_group_id        = "sg-061d8533c15b48235" -> (known after apply) # forces replacement
        self                     = false
      + source_security_group_id = (known after apply)
        to_port                  = 0
        type                     = "egress"
    }

  # module.asg.aws_security_group_rule.allow_atlantis must be replaced
-/+ resource "aws_security_group_rule" "allow_atlantis" {
        cidr_blocks              = [
            "0.0.0.0/0",
        ]
        from_port                = 4141
      ~ id                       = "sgrule-1270147250" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
        protocol                 = "tcp"
      ~ security_group_id        = "sg-0cf06e35da33a8a10" -> (known after apply) # forces replacement
        self                     = false
      + source_security_group_id = (known after apply)
        to_port                  = 4141
        type                     = "ingress"
    }

  # module.asg.aws_security_group_rule.allow_ssh must be replaced
-/+ resource "aws_security_group_rule" "allow_ssh" {
        cidr_blocks              = [
            "0.0.0.0/0",
        ]
        from_port                = 22
      ~ id                       = "sgrule-796290933" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
        protocol                 = "tcp"
      ~ security_group_id        = "sg-08b15b34c3c2eaf93" -> (known after apply) # forces replacement
        self                     = false
      + source_security_group_id = (known after apply)
        to_port                  = 22
        type                     = "ingress"
    }

  # module.asg.aws_security_group_rule.allow_web will be destroyed
- resource "aws_security_group_rule" "allow_web" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 80 -> null
      - id                = "sgrule-520120086" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-00716cfa523becb7a" -> null
      - self              = false -> null
      - to_port           = 80 -> null
      - type              = "ingress" -> null
    }

Plan: 5 to add, 1 to change, 9 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/dev/webserver-cluster`
* :put_litter_in_its_place: To **delete** this plan click [here](http://tf-atlantis-alb-1013814802.eu-west-2.elb.amazonaws.com/events/lock?id=aws-freetier%252Ftf-aws-rnbv-complex%252Flive%252Fdev%252Fwebserver-cluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/dev/webserver-cluster`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
